Page({

  /**
   * 页面的初始数据
   */
  data: {
    listArr:"/images/like.png",
    listarr:[
      {url:"/images/1.jpg",name:"张三",time:"2020-02-22",writing:"秋起，有微风滑过的清香，有阳光照射的明媚，有树叶儿滑落的声响，还有，一抹抹微凉拂过心头的舒畅。微风，轻掀起衣角，轻吻着发丝，不经意间，那些春花夏梦的记忆，就感染这个多情的秋季。于是，心，慢慢的沉浸，轻轻的驻足，让心停歇，聆听风，倾听雨，原来，岁月处处都充满着暖意……"},
      {url:"/images/2.jpg",name:"李四",time:"2020-02-22",writing:"岁月轮转，时光静静的流逝，金秋的风，悄悄地拂过窗棂，轻轻地掀起清秋的面纱，听风，唱响时间的流淌，穿过，岁月沧桑的河岸，仿佛，经年就在眼前，那些消失在岁月长河里的人和事，还有一些一些的美丽，都化着点滴斑斓，飞散在这个季节深处。岁月，就是一轮维修机，有再多磨合都已不在重要，重要的是有一颗宽容，淡定，从容的心。守着一份份清淡，生活已不再那么烦躁，或许，生活就是要我们简单随和，就是最好……"},
      {url:"/images/3.jpg",name:"王武",time:"2020-02-22",writing:"当季节逐渐走向冷凉，那些花丛草间的美丽，都已被枯黄所逐渐替代 。岁月，就是一道道流程相拼的组合，无论那一程时光失去美丽，都会有一段记忆在心底存着。人的思维有时候就是那样脆弱，即使，一滴滴的念想，都能牵动着脉搏为此波动。怀念那一段段时光，怀念那些有山，有水，有花，有草的日子里，相互走过的岁月，相拥过的时光，相许过的年华。看青春的影子逐渐远去，那些曾经拥有的，失去的，美丽的，忧伤的，都只不过是一场梦。唯此，心歇淡然，守望宁静，安放一处淡泊，于岁月深处，随风起舞，将爱依旧继续……"},
      {url:"/images/4.jpg",name:"张三",time:"2020-02-22",writing:"风空空洞洞地吹过。一年又这么过去。而来年，还要这么过去。我不知道是安稳的背后隐藏着沮丧，还是沮丧里终归有安稳。只是我们，无法找到。"},
      {url:"/images/5.jpg",name:"张三",time:"2020-02-22",writing:"就像世界上没有完全相同的两片叶子一样，每个人都有一份自己独特的优秀。善于宽容别人的缺点，善于更多地欣赏别人出色之处，不仅体现为开阔的胸襟，还体现为一种为人处事的智慧。而能够越早地发现自己最出色地地方，越能充分发挥自己地潜能，越能够拥抱成功。"},
      {url:"/images/6.jpg",name:"张三",time:"2020-02-22",writing:"如果黑板就是浩淼的大海，那么，老师便是海上的水手。铃声响起那刻，你用教职工鞭作浆，划动那船只般泊在港口的课本 。课桌上，那难题堆放，犹如暗礁一样布列，你手势生动如一只飞翔的鸟，在讲台上挥一条优美弧线——船只穿过……天空飘不来一片云，犹如你亮堂堂的心，一派高远。"},
     ],
     navbar: ['最新', '最热', '精华'], 
  currentTab: 0 
  },
  navbarTap: function(e){ 
    this.setData({ 
     currentTab: e.currentTarget.dataset.idx 
    })
   } ,
   a:function(){
     console.log(123)
  },
  click:function(){
    console.log(123)
    this.setData({
      listArr:"/images/like-a.png"
    })

  },


  /**
   * 生命周期函数--监听页面加载
   */
  onLoad: function (options) {
    
  },

  /**
   * 生命周期函数--监听页面初次渲染完成
   */
  onReady: function () {
    
  },

  /**
   * 生命周期函数--监听页面显示
   */
  onShow: function () {
    
  },

  /**
   * 生命周期函数--监听页面隐藏
   */
  onHide: function () {
    
  },

  /**
   * 生命周期函数--监听页面卸载
   */
  onUnload: function () {
    
  },

  /**
   * 页面相关事件处理函数--监听用户下拉动作
   */
  onPullDownRefresh: function () {
    
  },

  /**
   * 页面上拉触底事件的处理函数
   */
  onReachBottom: function () {
    
  },

  /**
   * 用户点击右上角分享
   */
  onShareAppMessage: function () {
    
  }
})